OpenFOAM-6-cantera-openmpi/tutorials/incompressible/simpleFoam/rotorDisk/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Meshing
runApplication blockMesh
runApplication surfaceFeatures
runApplication snappyHexMesh -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
